package algorythym;
/*
Структура данных - способ организации данных в памяти компьютера
Примеры: массивы, связанные списки, стеки, очередь,
двоичные деревья, хеш-таблицы, графы и т.д.

Алгоритм - последовательность действий, которые обеспечивают различные операции
с разными стуктурами данных
(поиск, вычисление, сортировка)

массив
+ быстрая вставка, очень быстрый доступ (если известен индекс)
- медленный поиск, медленное удаление, фиксированный размер

Упорядоченный массив
+ поиск выполняется быстрее чем в обычном массиве
- медленная вставка и удаление, фиксированный размер

Стек
+ Доступ в порядке LIFO (последний пришел, первый ушел)
- Медленный доступ к другим элементам

Очередь
+ Доступ в порядке FIFO (First In, First Out - первый пришел, первый вышел(
- Медленный доступ в другим элементам

Связанный список
+ Быстрая вставка, быстрое удаление
- Медленный поиск

Двоичное дерево
+ Быстрый поиск, вставка, удаление (если дерево остается сбалансированным)
- Сложный алгоритм удаления

Красно-черное дерево
+ Быстрый поиск, вставка, удаление. Дерево всегда сбалансировано
- Сложность

Хеш-таблица
+ Очень быстрый доступ (если известен ключ)
- Медленное удаление, медленный доступ (если ключ неизвестен)

Куча
+ Быстрая вставка, удаление, доступ к наибольшему элементу
- Медленный доступ к другим элемента

Граф
+ Моделирование реальных ситуаций
- Некоторые алгоритмы медленны и сложны


 */
public class Lesson1 {
    public static void main(String[] args) {

    }
}
